# Data Analysis for salary prediction

Dataset used: [Salary Prediction (Kaggle)](https://www.kaggle.com/datasets/thedevastator/jobs-dataset-from-glassdoor)

In [21]:
import pandas as pd
import numpy as np

In [14]:
org_df = pd.read_csv("dataset/salary_data_cleaned.csv")
print(org_df.shape)
org_df.head().iloc[:,20:]

(742, 28)

  job_state  same_state  age  python_yn  R_yn  spark  aws  excel
0        NM           0   47          1     0      0    0      1
1        MD           0   36          1     0      0    0      0
2        FL           1   10          1     0      1    0      1
3        WA           1   55          1     0      0    0      0
4        NY           1   22          1     0      0    0      1

In [22]:
df = org_df[["Rating", "hourly", "employer_provided",
             "same_state", "age", "python_yn", "R_yn", "spark", "aws", "excel", "avg_salary"]]
df.apply(lambda x: np.float32(x))
df.head()

,Rating,hourly,employer_provided,same_state,age,python_yn,R_yn,spark,aws,excel,avg_salary
0,3.8,0,0,0,47,1,0,0,0,1,72.0
1,3.4,0,0,0,36,1,0,0,0,0,87.5
2,4.8,0,0,1,10,1,0,1,0,1,85.0
3,3.8,0,0,1,55,1,0,0,0,0,76.5
4,2.9,0,0,1,22,1,0,0,0,1,114.5

In [28]:
neg_rows = set()
for col in df:
    for i, val in enumerate(df[col]):
        if val<0: neg_rows.add(i)
        
df = df.drop(index=list(neg_rows))
df = df.reset_index(drop=True)
print(df.shape)
df.head()

(690, 11)

,Rating,hourly,employer_provided,same_state,age,python_yn,R_yn,spark,aws,excel,avg_salary
0,3.8,0,0,0,47,1,0,0,0,1,72.0
1,3.4,0,0,0,36,1,0,0,0,0,87.5
2,4.8,0,0,1,10,1,0,1,0,1,85.0
3,3.8,0,0,1,55,1,0,0,0,0,76.5
4,2.9,0,0,1,22,1,0,0,0,1,114.5